# 1. Плотность водных растворов фосфорной кислоты рассчитывается по формуле:
# d = A0 + A1W – (A2 – A3W)×t,
# где d – плотность раствора кислоты г/см3
# , W – массовая доля H3PO4, масс. %, t – температура o
# C.
# A0 = 0.68235; A1 = 1.20811×10-2; A2 = 1.2379×10-3; A3 = 3.7938×10-6.
# Проверить точность расчёта по этой формуле, если экспериментальные данные представлены
# таблицей в зависимости от массовой доли H3PO4, и температуры:
# 2. Повторить п.1. с использованием лямбда-функций и функции map.
# 3. Выполнить задания PyCharm Edu раздела Functions


def chem_func(ai, w, t):
    d = ai[0] + (ai[1] * w) - (ai[2] - (ai[3] * w)) * t
    return d


def main():
    ai = [0.68235, 1.20811 * (10 ** -2), 1.2379 * (10 ** -3), 3.7938 * (10 ** -6)]

    dataset = {
        (130, 1.6141): 86.68,
        (140, 1.6028): 86.68,

        (25, 1.7261): 88.28,
        (130, 1.6324): 88.28,
        (140, 1.6237): 88.28,

        (130, 1.6479): 89.58,
        (140, 1.6387): 89.58,

        (130, 1.6594): 90.63,
        (140, 1.6508): 90.63,

        (130, 1.6894): 92.97,
        (140, 1.6806): 92.97,

        (130, 1.6992): 93.82,
        (140, 1.6918): 93.82,

        (25, 1.8010): 94.38,
        (130, 1.7080): 94.38,
        (140, 1.7000): 94.38,

        (25, 1.8390): 97.48,
        (130, 1.7478): 97.48,
        (140, 1.7395): 97.48,

        (25, 1.8522): 98.66,
        (130, 1.7607): 98.66,
        (140, 1.7528): 98.66,

        (25, 1.8818): 100.93,
        (130, 1.7908): 100.93,
        (140, 1.7830): 100.93,

        (25, 1.8875): 101.60,
        (130, 1.7973): 101.60,
        (140, 1.7890): 101.60,
    }
    keys = list(dataset.keys())

    for i in range(len(dataset)):
        print("==========Data==========")
        t = keys[i][0]
        w = keys[i][1]
        print(f"t={t} | w={w}")
        d_exp = dataset[(t, w)]
        d_comp = chem_func(ai, w, t)
        print(f"experimental d={d_exp}")
        print(f"computational d={d_comp}")
        print(f"diff={abs(d_exp - d_comp)}")


if __name__ == "__main__":
    main()
